packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "extmem_manager.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
// #include "stm32n6570_discovery_xspi.h"
// #include "stm32n6570_discovery_errno.h"
#include "stm32n6570_discovery.h"    /* BSP: COM1 VCP UART + LEDs (board-canonical) */
#include "stai_network.h"            /* STAI API + the TCN NPU model (Neural-ART HW) */
#include "network_tokens.h"          /* device tokenizer support (rule prompts + decode) */
#include "npu_query.h"               /* grammar-oracle bridge (autoregressive NPU recall) */
#include "grammar_runner.h"          /* parse + evaluate via the oracle (the calculator) */
#include "lcd.h"                     /* LTDC + panel bring-up (display) */
#include "psram.h"                   /* external PSRAM map + self-test (framebuffer + app data) */
#include "lvgl_port_n6.h"            /* LVGL 9.x DIRECT-mode port on the PSRAM framebuffer */
#include "lvgl_scene.h"              /* C2 test scene */
// #include "stm32n6xx_hal_bsec.h"
// #include "stm32n6xx_hal_ramcfg.h"
// #include "llm_fsbl.h"
// #include "llm_test_fsbl.h"
// #include "npu_init.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CACHEAXI_HandleTypeDef hcacheaxi;

RAMCFG_HandleTypeDef hramcfg_SRAM1;
RAMCFG_HandleTypeDef hramcfg_SRAM2;
RAMCFG_HandleTypeDef hramcfg_SRAM3;
RAMCFG_HandleTypeDef hramcfg_SRAM4;
RAMCFG_HandleTypeDef hramcfg_SRAM5;
RAMCFG_HandleTypeDef hramcfg_SRAM6;

UART_HandleTypeDef huart1;

XSPI_HandleTypeDef hxspi1;
XSPI_HandleTypeDef hxspi2;

/* USER CODE BEGIN PV */
COM_InitTypeDef BspCOMInit;

volatile int debugFlag = 0;  /* 1 = spin in catch loop for MCP GDB attach + release (methodology). */
volatile uint32_t g_boot_stage = 0;  /* init progress marker — read via GDB to localize a stall/error */
volatile int      g_psram_rc   = 99; /* PSRAM_Init() result: 0=mapped+writable, <0=fail, 99=not run */
volatile int      g_lvgl_ok    = 0;  /* 1 once lvgl_port_n6_init succeeded */
volatile uint32_t g_heartbeat  = 0;  /* SW heartbeat counter (bare-metal liveness; HW LED mirrors it) */
/* Display-clean experiment (2026-06-30): 1 = suppress the per-token CPU<->NPU UART dialog
 * (NPU_LogStep) so a rule query is "just infer + display". The dialog is a blocking colour UART
 * line PER TOKEN inside the token loop, and lv_timer_handler never runs during that loop — so the
 * logging only lengthens the window the panel spends in the gate-toggling flicker state. Silencing
 * it shortens each inference cycle (less flicker, less per-cycle degradation), matching the
 * reference's minimal-work-per-frame pattern. Set to 0 to restore the full oracle dialog.
 * TESTED ON DEVICE 2026-06-30: does NOT fix the glitch — it still happens with quiet=1. Confirms
 * the glitch is the intrinsic per-EPOCH NPU<->LTDC AXI contention, independent of UART/CPU churn
 * duration. The real fix is the reference's dirty-region update pattern + D-cache (not this). Kept
 * on (=1) at the user's request. */
volatile int      g_npu_quiet  = 1;

/* Per-epoch LTDC display gate. 1 = gate ON (default, REQUIRED): Layer1 fetch is disabled around each
 * NPU epoch so the LTDC stops contending for the shared AXI bus during inference. 0 = gate DROPPED.
 * ON-DEVICE PROOF (2026-07-01, IPEVO video A/B): with the gate OFF the panel suffers catastrophic
 * whole-screen scanline corruption during every inference (live-scanout starvation — FB bytes stay
 * correct, ISR/LEN look healthy, so it is INVISIBLE to SWD; only a camera sees it). Enabling stage-1
 * D-cache lowers CPU bus traffic but the NPU's own two 64-bit AXI masters alone still starve the LTDC
 * PSRAM scanout, so D-cache does NOT let the gate be dropped. Gate ON = clean apart from a mild
 * per-epoch dim. Runtime-togglable via GDB write_memory (D-cache-coherent through the MCP write) for
 * A/B testing. Real glitch-free path (reference-style, no gate) = cut LTDC PSRAM read bandwidth
 * (8bpp+CLUT or lower res) or an AXISRAM scanout buffer — see README § Display. */
volatile int      g_npu_gate   = 1;

/* NPU model (TCN, STAI). Opaque context buffer — sized by the generated header, 8-aligned. */
__attribute__((aligned(STAI_NETWORK_CONTEXT_ALIGNMENT)))
static uint8_t s_network_ctx[STAI_NETWORK_CONTEXT_SIZE];
static stai_network *g_network = NULL;
/* The Neural-ART HW network bakes its activations in its memory pool (ACTIVATIONS_NUM=0) —
 * no app-provided activation buffer needed. */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_XSPI1_Init(void);
static void MX_XSPI2_Init(void);
static void MX_BSEC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_RAMCFG_Init(void);
static void MX_ICACHE_Init(void);
static void MX_CACHEAXI_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */
static void Enable_NPU_RAM_ForCore(void);
static void Enable_AXICACHE_RAM_ForCore(void);
static void OpenDebug(void);
extern void TerminalLogger_SmokeTest(void);  /* C++ TerminalLogger (terminal_logger.cpp), extern "C" */
extern void Cpp_STL_SmokeTest(void);         /* C++ STL infra test (cpp_runtime.cpp), extern "C" */
extern void NPU_SetVerbose(int on);          /* per-token NPU dialog toggle (grammar_runner.cpp) */
// void LLM_Repl_Run(void);   /* interactive NPU grammar REPL (llm_repl.cpp) */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/* Direct-register USART1 TX — HAL_UART_Transmit fails silently in the FSBL boot context
 * (HAL_GetTick may not advance), per reference N6_EDGEAI_1. Poll ISR.TXFNF (bit 7), write TDR. */
// static void uart1_putc(char c)
// {
//     while ((USART1->ISR & (1u << 7)) == 0) { __NOP(); }
//     USART1->TDR = (uint32_t)(uint8_t)c;
// }
// static void uart_puts(const char *s)
// {
//     if (USART1->CR1 == 0U) return;   /* UART not initialised yet */
//     for (; *s; ++s) uart1_putc(*s);
// }

