packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
    /* Grant all CIDs RISAF R/W on the NPU memory (AXISRAM weights @0x34064000 +
     * activations) + the NPU masters + NPU cache — without this the NPU epoch stalls
     * reading the weights. Mirrors NPU_Validation set_risaf_default. */
    {
      RISAF_TypeDef *const npu_risafs[] = { RISAF2_S, RISAF4_S, RISAF5_S, RISAF6_S, RISAF8_S };
      RISAF_BaseRegionConfig_t rc;
      memset(&rc, 0, sizeof(rc));
      rc.StartAddress   = 0x0;
      rc.EndAddress     = 0x0FFFFFFF;
      rc.Filtering      = RISAF_FILTER_ENABLE;
      rc.PrivWhitelist  = RIF_CID_NONE;
      rc.ReadWhitelist  = RIF_CID_MASK;
      rc.WriteWhitelist = RIF_CID_MASK;
      for (unsigned i = 0; i < sizeof(npu_risafs) / sizeof(npu_risafs[0]); i++)
      {
        rc.Secure = RIF_ATTRIBUTE_SEC;
        HAL_RIF_RISAF_ConfigBaseRegion(npu_risafs[i], RISAF_REGION_1, &rc);
        rc.Secure = RIF_ATTRIBUTE_NSEC;
        HAL_RIF_RISAF_ConfigBaseRegion(npu_risafs[i], RISAF_REGION_2, &rc);
      }
    }

    printf("NPU clocked + reset OK + AXI cache + RISAF mem (boot_stage=%lu)\r\n", (unsigned long)g_boot_stage);
  }

  /* NPU RUNTIME (global ATON runtime init — MUST run before any network init/run).
   * The --st-neural-art network runs as epoch *blobs* on the NPU epoch controller,
   * whose host sync is interrupt-based (RM0486 §20.3.15-16) and supported ONLY in
   * LL_ATON_RT_ASYNC mode (polling asserts out — ll_aton_runtime.c:132). The runtime
   * init is gated behind stai_runtime_init() (NOT stai_network_init): it enables the
   * ATON interrupt controller and INSTALL+NVIC_EnableIRQ(NPU0_IRQn) so the epoch-end
   * IRQ wakes the runtime's __WFE(). Skipping it = silent WFE stall (init OK, run never
   * returns) — the earlier polling-mode bug. Build sets -DLL_ATON_RT_MODE=ASYNC. */
  {
    stai_return_code rrc = stai_runtime_init();
    if (rrc != STAI_SUCCESS)
    {
      printf("NPU runtime init FAILED (stai rc=%d)\r\n", (int)rrc);
      Error_Handler();
    }
    printf("NPU runtime init OK (ATON INTCTRL + NPU0 IRQ enabled, ISER1=0x%08lX)\r\n",
           (unsigned long)NVIC->ISER[1]);
  }

  /* NPU MODEL */
  {
    /* Initialize the TCN model context (STAI). Inputs/outputs/weights are preallocated
     * in network.c / network_data.c and placed by the custom linker. */
    g_network = (stai_network *)s_network_ctx;
    stai_return_code rc = stai_network_init(g_network);
    if (rc != STAI_SUCCESS)
    {
      printf("NPU model init FAILED (stai rc=%d) - boot_stage=%lu\r\n",
             (int)rc, (unsigned long)g_boot_stage);
      Error_Handler();
    }
    g_boot_stage = 9;
    printf("NPU HW model init OK (ctx=%u B, weights @0x34064000)\r\n",
           (unsigned)STAI_NETWORK_CONTEXT_SIZE);
  }

  /* NPU INFERENCE — boot self-test: prove the Neural-ART path end-to-end on-device. */
  {
    stai_ptr in_buf = NULL, out_buf = NULL;
    stai_size n_in = 0, n_out = 0;
    stai_network_get_inputs(g_network, &in_buf, &n_in);
    stai_network_get_outputs(g_network, &out_buf, &n_out);
    if (in_buf == NULL || out_buf == NULL)
    {
      printf("NPU get in/out FAILED\r\n");
      Error_Handler();
    }

    g_boot_stage = 10;
    {
      const char *expr = "3 + 4";
      int ok = 0;
      long res = Grammar_Calc(g_network, (int8_t *)in_buf, (const int8_t *)out_buf, expr, &ok);
      if (ok) printf("\r\nNPU self-test: %s = %ld\r\n", expr, res);
      else    printf("\r\nNPU self-test: %s -> parse failed\r\n", expr);
    }
  }

  /* PSRAM status — mapped early in MX_XSPI1_Init (before the NOR/EXTMEM setup, so the NOR survives
   * the XSPI-manager reset). The NPU demo below is the stability gate: if it still computes (no red
   * LED), the early PSRAM map left XSPI2/NOR + the weights intact. */
  printf("\r\nPSRAM @0x90000000: %s (rc=%d)\r\n",
         (g_psram_rc == 0) ? "mapped + CPU-writable" : "FAILED", g_psram_rc);
  /* PSRAM_Mpu() — mark 0x90000000 Normal Non-Cacheable: the documented fix for the cacheable-FB
   * corruption (the framebuffer goes to garbage/all-red as the CPU + printf churn the D-cache; the
   * LTDC reads PSRAM directly and sees the cache-stale content). The earlier red-LED was from
   * flashing onto a wedged device (MCP reset is ineffective); retried here from a clean programmer
   * -hardRst. */
  if (g_psram_rc == 0) {
    PSRAM_Mpu();
  }

  /* Reference low-bus-traffic mechanical (flicker fix — stage 1): now that PSRAM_Mpu() has marked the
   * framebuffer window Normal-Non-Cacheable in an ENABLED MPU, turn the M55 L1 caches ON. This is the
   * lever that lets the reference (N6_EDGEAI_1) run the NPU concurrently glitch-free on the same
   * silicon: with D-cache on, the CPU working set (embedding Gather, token loop, LVGL heap in
   * cacheable AXISRAM1) is absorbed by cache instead of flooding the AXI interconnect that the LTDC
   * scans the framebuffer from — the root cause of the inference-time scanout starvation. Ordering is
   * critical: the FB MUST already be non-cacheable (above) so LVGL's pixel writes never sit in cache
   * for the LTDC to read stale; flush_cb's __DSB drains them to PSRAM before each swap. The NPU
   * activation arena stays write-back, and the STAI runtime's mcu_cache_* hooks (self-gated on
   * SCB->CCR.DC) now auto-invalidate the network output each epoch; the CPU-filled input is cleaned
   * explicitly in npu_query.c. SCB_EnableDCache invalidates the whole D-cache before enabling, so
   * prior uncached writes (weights memcpy, BSS) are already in memory — no stale lines. */
  SCB_EnableICache();
  SCB_EnableDCache();

  /* LCD: LTDC + Layer-1 @0x90000000 up (paints a brief R/G/B pattern). */
  LCD_Init();

  /* LVGL (DIRECT mode) renders straight into the same PSRAM framebuffer the LTDC scans — it repaints
   * the whole frame continuously, so it overwrites/absorbs the static-FB corruption. */
  if (g_psram_rc == 0) {
    /* DWT cycle counter = lvgl_port_n6's ms tick source. */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

    lvgl_port_n6_cfg_t lv_cfg = {
      .fb_addr         = (void *)0x90000000U,   /* PSRAM — AXISRAM4-6 is the NPU activation arena (see lcd.c) */
      .fb_width        = 800U,
      .fb_height       = 480U,
      .fb_bytes_per_px = 2U,
      .hclk_hz         = 800000000U,   /* run-23 HCLK (DWT->ms); tweak if clock differs */
      .build_scene_cb  = lvgl_scene_build,
    };
    g_lvgl_ok = (lvgl_port_n6_init(&lv_cfg) == LVGL_PORT_N6_OK);
    printf("LVGL: init %s (DIRECT @0x90000000)\r\n", g_lvgl_ok ? "ok" : "FAILED");
  }

