packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
  /* Autonomous on-chip calculator over the ST-Link VCP (USART1 / huart1). The device does
   * ALL the work — this proves edge autonomy. The host unified runner in `--mode device` is a
   * thin terminal: it pushes an expression and collects the result; the tokenize, parse, evaluate
   * and NPU grammar recall all run HERE on the Cortex-M55 + Neural-ART. Connect directly with
   *   minicom -D /dev/ttyACM0 -b 115200
   * or via the runner (scripts/classes/class_model_runner.py --mode device). */
  {
    stai_ptr rin = NULL, rout = NULL; stai_size rn = 0;
    stai_network_get_inputs(g_network, &rin, &rn);
    stai_network_get_outputs(g_network, &rout, &rn);
    NPU_SetVerbose(0);   /* concise: per-rule [model #N] dialog, no per-token spam */

    /* Per-grammar demo set: the CALCULATOR grammar's test expressions. Each grammar carries its own
     * demo/test inputs; the `/demo` runner command cycles the active grammar's set. (run-23 carries
     * one grammar today; a future grammar would ship its own set.) */
    static const char *const calc_demo[] = { "3 + 4", "12 - 5", "6 * 7", "8 / 2", "9 * 9", "2 * (3 + 4)" };
    const int ndemo = (int)(sizeof(calc_demo) / sizeof(calc_demo[0]));

    /* Interactive CLI over the VCP (minicom -D /dev/ttyACM0 -b 115200), line-buffered, with a built-in
     * `/demo` runner command (orchestration — NOT a nocode grammar; the carried *logic* is the
     * dispatch). Accepts any phrasing: "/demo", "/demo off", "/demo calculator on", "/calculator demo
     * off" — a line containing "demo" toggles the loop (off when it also contains "off"). Anything
     * else is evaluated as an expression on-chip via the nocode dispatch + NPU. Heartbeat (GREEN LED
     * + g_heartbeat) ticks throughout; RED lights only on an error. Demo runs by default at boot. */
    uint32_t hb_last = HAL_GetTick(), demo_last = 0U;
    int di = 0, demo_on = 1;
    char cmd[48]; int cmdn = 0;
    printf("\r\n=== NPU calculator — demo running.  /demo off  ·  /demo on  ·  or type an expression ===\r\n");
    for (;;)
    {
      uint32_t now = HAL_GetTick();
      if (now - hb_last >= 500U) { hb_last = now; BSP_LED_Toggle(LED_GREEN); g_heartbeat++; }  /* heartbeat */
      if (g_lvgl_ok) { lvgl_scene_tick(lvgl_port_n6_loop_count, g_heartbeat); lvgl_port_n6_run_once(); }  /* LVGL frame */

      uint8_t ch;                              /* line-buffered command/expression input (non-blocking) */
      if (huart1.Instance->ISR & USART_ISR_ORE) { huart1.Instance->ICR = USART_ICR_ORECF; }  /* clear overrun: the super-loop stalls ~ms during NPU inference so a byte can be missed; without this the ORE flag wedges HAL RX and the UART goes dead ("cannot write to it") */
      if (huart1.Instance->ISR & USART_ISR_RXNE_RXFNE) {
        ch = (uint8_t)(huart1.Instance->RDR & 0xFFU);   /* read straight from the UART; reading RDR clears the RX flag */
        if (ch == '\r' || ch == '\n') {
          cmd[cmdn] = '\0';
          if (cmdn > 0) {
            if (strstr(cmd, "demo") != NULL) {   /* /demo [grammar] [on|off] — orchestration command */
              demo_on  = (strstr(cmd, "off") == NULL);
              demo_last = 0U;
              printf("\r\n[demo %s]\r\n", demo_on ? "on" : "off");
            } else {                             /* evaluate as an expression (the calculator grammar) */
              int ok = 0;
              if (g_lvgl_ok) { lvgl_scene_set_prompt(cmd); lvgl_port_n6_run_once(); }   /* show the prompt */
              long res = Grammar_Calc(g_network, (int8_t *)rin, (const int8_t *)rout, cmd, &ok);   /* gates LTDC fetch per NPU epoch internally */
              if (g_lvgl_ok) { char ab[40]; if (ok) snprintf(ab, sizeof ab, "= %ld", res); else snprintf(ab, sizeof ab, "parse error"); lvgl_scene_set_answer(ab); lvgl_port_n6_run_once(); }   /* show the answer */
              if (ok) printf("\r\n= %ld\r\n", res);
              else  { printf("\r\nparse failed for \"%s\"\r\n", cmd); BSP_LED_On(LED_RED); }
            }
          }
          cmdn = 0;
        } else if (ch == 0x08 || ch == 0x7F) { if (cmdn > 0) { --cmdn; printf("\b \b"); } }
        else if (cmdn < (int)sizeof(cmd) - 1) { cmd[cmdn++] = (char)ch; HAL_UART_Transmit(&huart1, &ch, 1, 100); }
      }

      if (demo_on && (now - demo_last >= 2000U)) {   /* demo cadence: next expression every 2 s (circular) */
        demo_last = now;
        const char *expr = calc_demo[di]; di = (di + 1) % ndemo;
        int ok = 0;
        /* GATED inference (ST-confirmed AXI-contention fix): show the prompt, then DISABLE the LTDC
         * layer so it stops fetching the framebuffer while the NPU floods the shared AXI bus, run the
         * NPU, re-ENABLE the layer, then show the answer. No LTDC fetch during inference -> no contention
         * -> no live-scanout corruption. */
        if (g_lvgl_ok) { lvgl_scene_set_prompt(expr); lvgl_port_n6_run_once(); }   /* show the prompt (no NPU yet) */
        long res = Grammar_Calc(g_network, (int8_t *)rin, (const int8_t *)rout, expr, &ok);   /* gates the LTDC fetch per NPU epoch internally */
        if (g_lvgl_ok) { char ab[40]; if (ok) snprintf(ab, sizeof ab, "= %ld", res); else snprintf(ab, sizeof ab, "ERROR"); lvgl_scene_set_answer(ab); lvgl_port_n6_run_once(); }   /* show the answer */
        if (ok) printf("[hb %lu] %s = %ld\r\n", (unsigned long)g_heartbeat, expr, res);
        else  { printf("[hb %lu] %s -> ERROR\r\n", (unsigned long)g_heartbeat, expr); BSP_LED_On(LED_RED); }
      }
    }
  }
  /* USER CODE END 2 */

  /* Launch the application */
  if (BOOT_OK != BOOT_Application())
  {
    Error_Handler();
  }
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}
/* USER CODE BEGIN CLK 1 */
/* USER CODE END CLK 1 */

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the System Power Supply
  */
  if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK)
  {
    Error_Handler();
  }

